import telebot
import os
import random
bot = telebot.TeleBot("8032863270:AAEv5JsUpWS8IaAMo9yKxGXdkyXJWSdK0Kc")

@bot.message_handler(commands=['start', 'hello'])
def send_welcome(message):
    bot.reply_to(message, f'Здравствуйте! Я бот {bot.get_me().first_name}! Если хотите узнать, что делает этот бот напишите /help')

@bot.message_handler(commands=['help'])
def help(message):
    bot.reply_to(message, 'Этот бот умеет: рассказывать факты (с мемами) по команде /fakt, поддержать в твоих начинаниях или дать идею по команде /say, рассказать, что случится в случае глобального потепления по команде /shablon ')


@bot.message_handler(commands=['fakt'])
def send_mem(message):
        Kar = os.listdir("Kar")
        img__name = random.choice(Kar)
        with open(f'Kar/{img__name}', 'rb') as f:   
            bot.send_photo(message.chat.id, f)
        bot.reply_to(message, 'Мемы могут повторяться всего их 4)')
@bot.message_handler(commands=['say'])
def send_mem(message):
   bot.reply_to(message, 'Здравствуйте у Вас есть вариант как спасти природу от глобального потепления? Напишите /Yes (да) или /No (нет) /Bye (пока).')
@bot.message_handler(commands=['Bye'])
def send_yes(message):
     bot.reply_to(message, 'До свидания!👋')
    
@bot.message_handler(commands=['Yes'])
def send_yes(message):
    bot.reply_to(message, 'Отлично, главное не бойтесь если Вам больше 18, то Вы можете подать заявку и найти спонсора, если Ваш проект одобрят. Если меньше, то попросите родителей. Надеюсь у Вас всё получится! Если это не глобально, то тем болле начинайте! Хорошего начала!')

@bot.message_handler(commands=['No'])
def send_no(message):
        bot.reply_to(message, 'Жаль. Давайте я Вам несколько вариантов подкину? Напишите /no (нет) или /yes (да)!')

@bot.message_handler(commands=['no'])
def send__no(message):
    bot.reply_to(message, 'Ну ладно,до свидания👋')
@bot.message_handler(commands=['yes'])
def send__yes(message):
    bot.reply_to(message, ' Вы можете отказаться от личной автомашины в пользу ходьбы, езды на велосипеде или общественного транспорта, а так-же призвать к этому других(Вы не одни). Выставляйте на термостате системы отопления более низкую температуру включения.Сушите постиранное белье на веревке, а не в электросушилке.Установите термоизоляцию на чердаке и под крышей для уменьшения потерь тепла в зимний период. Отключайте от сети электроприборы, которыми вы не пользуетесь.')
#Больше тут: https://64.vtorproekt.com/article/okruzhayushchaya-sreda-kak-sokhranit-ee-v-sushchestvuyushchikh-usloviyakh.html')

@bot.message_handler(commands=['shablon'])
def send_mem(message):
    bot.reply_to(message, '1. Экстремальная погода: Учащение и усиление волн жары, засух, ливней, ураганов и наводнений.')
    bot.reply_to(message, '2. Таяние льдов: Масштабное таяние ледников, в том числе многолетней мерзлоты, что может привести к обрушению инфраструктуры в северных регионах.')
    bot.reply_to(message, '3. Расширение пустынь: Увеличение площади пустынь из-за усиливающихся засух.')
    bot.reply_to(message, '4. Окисление океана: Изменение химического состава океана, что вредит морским экосистемам.')
    bot.reply_to(message, '5. Угроза здоровью: Распространение инфекционных заболеваний (например, холера, лихорадка денге), вспышки которых могут стать более частыми, а также обострение сердечно-сосудистых и респираторных заболеваний')
    bot.reply_to(message, '6. Продовольственная безопасность: Снижение урожайности из-за засух, наводнений и экстремальных температур, что может привести к росту мировых цен на продовольствие.')
    bot.reply_to(message, '7. Экстремальная погода: Миграция населения: Люди будут вынуждены покидать места обитания, которые оказываются подтопленными из-за повышения уровня моря или становятся непригодными для жизни из-за засух.')
    bot.reply_to(message, '8. Экономический ущерб: Рост затрат на ликвидацию последствий стихийных бедствий и на адаптацию к новым условиям.')
    bot.reply_to(message, '9. Биологическое разнообразие: Исчезновение многих видов животных и растений из-за непривычных условий, изменения их мест обитания и нарушения пищевых цепей')
    bot.reply_to(message, 'Жуть, не правда?')







#@bot.message_handler(func=lambda message: True)
#def echo_all(message):
   #txt = (message.text)

   #bot.reply_to(message, f"Вы написали: {txt}. Этот бот воспринимает команды /fakt, /say , /help, /pomoch.")


bot.polling()